{
  "Apollo 7": {
    "Walter M. Schirra, Jr.": {
      "Experience": "Pilot on Mercury-Atlas 8, command pilot on Gemini 6A, and spacecraft commander on Apollo 7.",
      "Place in history": "Schirra was the fifth American and ninth human being to fly into space.",
      "Fast fact": "During his Gemini mission, Schirra pranked NASA Mission Control by reporting he had seen Santa Claus.",
      "Lunar wisdom": "I left Earth three times and found no other place to go. Please take care of Spaceship Earth."
    },
    "Donn F. Eisele": {
      "Experience": "Command Module pilot on Apollo 7.",
      "Place in history": "Eisele was the first astronaut to test Apollo's guidance and navigation system.",
      "Fast fact": "A historian discovered Eisele's unpublished memoir, which he then edited and published in 2017, \"Apollo Pilot: The Memoir of Astronaut Donn Eisele.\"",
      "Lunar wisdom": "I was impressed from space with the wholeness of the Earth, and I believe the human race is one whole thing and we should be working together."
    },
    "R. Walter Cunningham": {
      "Experience": "Lunar Module pilot on Apollo 7.",
      "Place in history": "Cunningham was NASA's third civilian astronaut.",
      "Fast fact": "Cunningham co-authored a paper for the Rand Corporation, based in part on his experience in space, titled \"Importance of Observation That Stars Don't Twinkle Outside the Earth's Atmosphere.\"",
      "Lunar wisdom": "When we went to the moon, it was not only just standing on a new plateau for all mankind. We changed the way everybody in the world thought of themselves."
    }
  },
  "Apollo 8": {
    "Frank F. Borman II": {
      "Experience": "Command pilot on Gemini 7 and spacecraft commander on Apollo 8.",
      "Place in history": "As of 2019, Borman is the oldest living former U.S. astronaut.",
      "Fast fact": "Borman said that Apollo was a \"super-duper, plush touring bus\" compared to the tight confines of a Gemini capsule.",
      "Lunar wisdom": "A machine produced by more than 300,000 Americans was circling the moon with three human beings aboard for the first time in history."
    },
    "William A. Anders": {
      "Experience": "Lunar Module pilot on Apollo 8.",
      "Place in history": "Along with Frank Borman and James Lovell, Anders was one of the first humans to travel beyond low Earth orbit.",
      "Fast fact": "Anders' iconic photo, \"Earthrise,\" is credited as an inspiration for the environmental movement.",
      "Lunar wisdom": "We came all this way to explore the moon, and the most important thing is that we discovered the Earth."
    },
    "James A. Lovell, Jr.": {
      "Experience": "Pilot on Gemini 7, command pilot on Gemini 12, Command Module pilot on Apollo 8, and spacecraft commander on Apollo 13.",
      "Place in history": "He spent 715 hours in space, a record unsurpassed until Skylab.",
      "Fast fact": "Lovell's enthusiasm for space began early. He avidly read Jules Verne novels as a child and was, by the mid-1940s, in high school and building his own rockets.",
      "Lunar wisdom": "When viewed in total, Earth is a spaceship just like Apollo. We are all the crew of spaceship Earth and, just like Apollo, the crew must learn to live and work together."
    }
  },
  "Apollo 9": {
    "James A. McDivitt": {
      "Experience": "Command pilot on Gemini 4 and spacecraft commander on Apollo 9.",
      "Place in history": "McDivitt was one of only three NASA astronauts—along with Frank Borman and Neil Armstrong—whose first flight assignment was a command assignment.",
      "Fast fact": "McDivitt described the Lunar Module as \"a toaster oven with legs.\"",
      "Lunar wisdom": "It was a hell of a ride [on testing the Lunar Module in Earth orbit]."
    },
    "Russell \"Rusty\" Schweickart": {
      "Experience": "Lunar Module pilot on Apollo 9.",
      "Place in history": "Schweickart, along with David Scott, performed the first Apollo EVA.",
      "Fast fact": "Schweickart co-founded \"Asteroid Day,\" to raise awareness about the possible threat of asteroids to Earth.",
      "Lunar wisdom": "[You] become startlingly aware how artificial are thousands of boundaries we've created to separate and define."
    },
    "David R. Scott": {
      "Experience": "Pilot on Gemini 8, Command Module pilot on Apollo 9, and spacecraft commander on Apollo 15.",
      "Place in history": "Scott was the first to drive on the moon.",
      "Fast fact": "Scott re-created Galileo's famous experiment proving that gravity accelerates all objects equally regardless of their mass, when he dropped a falcon feather and geology hammer from the same height and they landed simultaneously on the lunar surface.",
      "Lunar wisdom": "For when I look at the moon I do not see a hostile, empty world. I see the radiant body where man has taken his first steps into a frontier that will never end."
    }
  },
  "Apollo 10": {
    "Thomas P. Stafford": {
      "Experience": "Pilot on Gemini 6A, command pilot on Gemini 9A, spacecraft commander on Apollo 10, and commander on Apollo-Soyuz Test Project.",
      "Place in history": "Stafford was a brigadier general when he served as commander on the Apollo-Soyuz Test Project, making him the first general in space.",
      "Fast fact": "The White House tasked Stafford with overseeing the report \"America at the Threshold,\" a road map for future space exploration, published in 1991.",
      "Lunar wisdom": "I remember looking back at this tiny blue planet and thinking, 'How in the hell can such a small place have so many problems?'"
    },
    "Eugene A. Cernan": {
      "Experience": "Pilot on Gemini 9A, Lunar Module pilot on Apollo 10, and spacecraft commander on Apollo 17.",
      "Place in history": "Cernan was the last person to walk on the moon.",
      "Fast fact": "Asteroid 12790 Cernan is named in his honor.",
      "Lunar wisdom": "Dream the impossible—and go out and make it happen. I walked on the moon. What can't you do?"
    },
    "John W. Young": {
      "Experience": "Pilot on Gemini 3, command pilot on Gemini 10, Command Module pilot on Apollo 10, spacecraft commander on Apollo 16, and mission commander on STS-1 and STS-9.",
      "Place in history": "Young was the first to orbit the moon alone. He went on to become NASA's longest-serving astronaut.",
      "Fast fact": "Unaware that his spacesuit's microphone was on, Young inadvertently broadcast an off-color, profanity-laced opinion about the amount of fruit juice the astronauts were advised to consume during the Apollo 16 mission.",
      "Lunar wisdom": "I think over this century if we industrialize the moon and use its resources, I think it can save civilization."
    }
  },
  "Apollo 11": {
    "Neil A. Armstrong": {
      "Experience": "Command pilot on Gemini 8 and spacecraft commander on Apollo 11.",
      "Place in history": "Armstrong was the first person to walk on the moon.",
      "Fast fact": "Growing up, Armstrong was fascinated with aviation. He learned how to fly before he had gotten his driver's license.",
      "Lunar wisdom": "The important achievement of Apollo was demonstrating that humanity is not forever chained to this planet and our visions go rather further than that and our opportunities are unlimited."
    },
    "Michael Collins": {
      "Experience": "Pilot on Gemini 10 and Command Module pilot on Apollo 11.",
      "Place in history": "Collins was the first person to perform two EVAs in one mission.",
      "Fast fact": "Collins says his \"secret terror\" was returning to Earth alone if the surface mission failed.",
      "Lunar wisdom": "I really believe that if the political leaders of the world could see their planet from a distance of 100,000 miles their outlook could be fundamentally changed. That all-important border would be invisible, that noisy argument silenced."
    },
    "Buzz Aldrin": {
      "Experience": "Pilot on Gemini 12 and Lunar Module pilot on Apollo 11.",
      "Place in history": "Aldrin was the second person to walk on the moon.",
      "Fast fact": "The maiden name of Aldrin's mother was \"Moon.\"",
      "Lunar wisdom": "While Neil was the first human to step onto the moon, I'm the first alien from another world to enter a spacecraft that was going to Earth."
    }
  },
  "Apollo 12": {
    "Charles \"Pete\" Conrad, Jr.": {
      "Experience": "Pilot on Gemini 5, command pilot on Gemini 11, spacecraft commander on Apollo 12, and commander on Skylab 2.",
      "Place in history": "In addition to being the third man to walk on the moon, Conrad commanded the first crewed Skylab mission, which was an emergency rescue of the station.",
      "Fast fact": "Conrad invented a fictitious astronaut named \"Walter Frisbee\" to play a prank on the press corps.",
      "Lunar wisdom": "Whoopee! Man, that may have been a small one for Neil, but that's a long one for me."
    },
    "Alan L. Bean": {
      "Experience": "Lunar Module pilot on Apollo 12 and commander of Skylab 3.",
      "Place in history": "Bean was the fourth person to walk on the moon.",
      "Fast fact": "When Bean left NASA, he became an artist. He has used moon dust and pieces of the Apollo spacecraft in his paintings.",
      "Lunar wisdom": "It was hard for me to believe. I would look down and say, 'This is the moon, this is the moon,' and I would look up and say, 'That's the Earth, that's the Earth,' in my head. So, it was science fiction to us even as we were doing it."
    },
    "Richard F. Gordon, Jr.": {
      "Experience": "Pilot on Gemini 11 and Command Module pilot on Apollo 12.",
      "Place in history": "Gordon, with Pete Conrad, on Gemini 11, set the record for highest apogee Gemini flight.",
      "Fast fact": "Gordon was in line to be the spacecraft commander on Apollo 18 and walk on the moon, but the mission was canceled due to budget constraints.",
      "Lunar wisdom": "We've often been asked, 'What did we discover when we went to the moon?' We discovered the Earth.... Its apparent fragility. Its uniqueness in the solar system, maybe the universe."
    }
  },
  "Apollo 13": {
    "James A. Lovell, Jr.": {
      "Experience": "Pilot on Gemini 7, command pilot on Gemini 12, Command Module pilot on Apollo 8, and spacecraft commander on Apollo 13."
    },
    "John L. Swigert , Jr.": {
      "Experience": "Command Module pilot on Apollo 13.",
      "Place in history": "Along with Jim Lovell and Fred Haise, Swigert was a member of the first astronaut crew to participate in a deep-space rescue mission.",
      "Fast fact": "Swigert was the crew member who made the iconic announcement, \"Houston, we've had a problem here.\"",
      "Lunar wisdom": "I was privileged to be one of the few who viewed our Earth from the moon, and that vision taught me that technology and commitment can overcome any challenge."
    },
    "Fred W. Haise, Jr.": {
      "Experience": "Lunar Module pilot on Apollo 13 and commander of the space shuttle approach and landing tests.",
      "Place in history": "Along with James Lovell and John Swigert, Haise holds the record for the farthest distance ever flown from Earth by humans.",
      "Fast fact": "Had Apollo 13 made it to the lunar surface, Haise would have been the sixth man to walk on the moon.",
      "Lunar wisdom": "If you do have…the right people, the right skill mix, that are trained and they're assembled in this team and they work together under the right leadership...a miracle can happen. And that's what was the case of Apollo 13."
    }
  },
  "Apollo 14": {
    "Alan B. Shepard, Jr.": {
      "Experience": "Pilot on Mercury-Redstone 3 and spacecraft commander on Apollo 14.",
      "Place in history": "The first American in space.",
      "Fast fact": "Shepard was the first (and thus far, only) person to play golf on the moon.",
      "Lunar wisdom": "I realized up there that our planet is not infinite. It's fragile."
    },
    "Stuart A. Roosa": {
      "Experience": "Command Module pilot on Apollo 14.",
      "Place in history": "The third man to fly the Command Module on the Apollo moon-landing missions.",
      "Fast fact": "Roosa, previously a U.S. Forest Service firefighter, carried hundreds of tree seeds into space that were later planted across the United States.",
      "Lunar wisdom": "It's the abject smallness of the Earth that gets you."
    },
    "Edgar D. Mitchell": {
      "Experience": "Lunar Module pilot on Apollo 14.",
      "Place in history": "Along with Alan Shepard, Mitchell set what was a new record at the time for the longest time on the lunar surface: 33 hours and 31 minutes.",
      "Fast fact": "In 1964, while studying at the Massachusetts Institute of Technology, he published his dissertation proposing a design for a guidance system for a low-thrust interplanetary spacecraft.",
      "Lunar wisdom": "From out there on the moon, international politics look so petty. You want to grab a politician by the scruff of the neck and drag him a quarter of a million miles out and say, 'Look at that, you son of a bitch.'"
    }
  },
  "Apollo 15": {
    "David R. Scott": {
      "Experience": "Pilot on Gemini 8, Command Module pilot on Apollo 9, and spacecraft commander on Apollo 15."
    },
    "Alfred Worden": {
      "Experience": "Command Module pilot on Apollo 15.",
      "Place in history": "The first-ever EVA in deep space.",
      "Fast fact": "Worden appeared on Mister Rogers' Neighborhood. \"If we wanted public support for NASA and space travel, we need to inspire and inform the kids.\"",
      "Lunar wisdom": "Earth is floating aimlessly, serenely / Peopled, I know, by intelligent life; / Man is ever driven on; / Vision greater than deed."
    },
    "James Irwin": {
      "Experience": "Lunar Module pilot on Apollo 15.",
      "Place in history": "Along with David Scott, Irwin set what was a new record at the time for mission length on the lunar surface: 66 hours and 54 minutes.",
      "Fast fact": "At the behest of a friend, Irwin left a small piece of lava from Oregon's Devils Lake on the surface of the moon.",
      "Lunar wisdom": "The Earth reminded us of a Christmas tree ornament hanging in the blackness of space…. That beautiful, warm, living object looked so fragile, so delicate, that if you touched it with a finger it would crumble and fall apart."
    }
  },
  "Apollo 16": {
    "John W. Young": {
      "Experience": "Pilot on Gemini 3, command pilot on Gemini 10, Command Module pilot on Apollo 10, spacecraft commander on Apollo 16, and mission commander on STS-1 and STS-9."
    },
    "Thomas \"Ken\" Mattingly II": {
      "Experience": "Command Module pilot on Apollo 16 and mission commander on STS-4 and STS-51-C.",
      "Place in history": "Mattingly commanded the first-ever space shuttle mission for the Department of Defense.",
      "Fast fact": "Mattingly's music playlist when orbiting the moon included Gustav Holst's \"The Planets\" and Hector Berlioz's \"Symphonie Fantastique.\"",
      "Lunar wisdom": "The novelty of floating really wears off after two-and-a-half days with someone in your face all the time."
    },
    "Charles M. Duke, Jr.": {
      "Experience": "Lunar Module pilot on Apollo 16.",
      "Place in history": "At age 36, he was the youngest person to walk on the moon.",
      "Fast fact": "Duke left a portrait of his family on the lunar surface. \"So just to get the kids excited about what dad was going to do, I said 'Would y'all like to go to the moon with me?' \" Duke recalls. \"We can take a picture of the family and so the whole family can go to the moon.\"",
      "Lunar wisdom": "We've been to the moon nine times. I mean, why did we fake it nine times, if we faked it?"
    }
  },
  "Apollo 17": {
    "Eugene A. Cernan": {
      "Experience": "Pilot on Gemini 9A, Lunar Module pilot on Apollo 10, and spacecraft commander on Apollo 17."
    },
    "Harrison \"Jack\" Schmitt": {
      "Experience": "Lunar Module pilot on Apollo 17.",
      "Place in history": "Schmitt was the first trained scientist to go to the moon.",
      "Fast fact": "Because Schmitt was not a pilot, he was sent to a 53-week course in flight training at Williams Air Force Base, Arizona, to prepare for Apollo.",
      "Lunar wisdom": "It's like trying to describe what you feel when you're standing on the rim of the Grand Canyon or remembering your first love or the birth of your child. You have to be there to really know what it's like."
    },
    "Ronald E. Evans, Jr.": {
      "Experience": "Command Module pilot on Apollo 17.",
      "Place in history": "Evans holds the record for the most time spent in orbit around the moon: 147 hours, 48 minutes.",
      "Fast fact": "Evans was on board the USS Ticonderoga, flying U.S. Navy combat missions in Vietnam, when he learned he had been selected to be an Apollo astronaut.",
      "Lunar wisdom": "You can't discover the source of the Missouri anymore. So where are you going to go but space?"
    }
  }
}